#include <iostream>
using namespace std;

int main() {
    // === Задача Begin35 ===
    // Дано три числа a, b, c. Потрібно знайти суму їх квадратів: a^2 + b^2 + c^2.
    cout << "Задача Begin35: Знайти суму квадратiв трьох чисел (a^2 + b^2 + c^2)." << endl;
    double a, b, c;
    cout << "Введiть три числа a b c: ";
    cin >> a >> b >> c;              // введення значень
    double sumSq = a*a + b*b + c*c;  // розрахунок суми квадратів
    cout << "Сума квадратiв: " << sumSq << endl;
    cout << "-----------------------------" << endl;

    // === Задача Begin14 ===
    // Дано змінні A, B, C. Змінити їх значення: A -> B, B -> C, C -> A (циклічна перестановка).
    cout << "Задача Begin14: Переставити вмiст A -> B, B -> C, C -> A." << endl;
    double A, B, C;
    cout << "Введiть значення A B C: ";
    cin >> A >> B >> C;
    // алгоритм: тимчасова змінна
    double temp = A;
    A = C;
    C = B;
    B = temp;
    cout << "Пiсля перестановки: A = " << A << ", B = " << B << ", C = " << C << endl;
    cout << "-----------------------------" << endl;

    // === Задача Begin27 ===
    // V1, V2 - швидкості автомобілів (км/год), S - початкова відстань (км), T - час (год).
    // Коли автомобілі рухаються в протилежних напрямках, відстань через T год:
    // D = S + (V1 + V2) * T
    cout << "Задача Begin27: Визначити вiдстань через T годин (автомобiлi вiддаляються один вiд одного)." << endl;
    double V1, V2, S, T;
    cout << "Введiть V1 V2 S T (через пробiл): ";
    cin >> V1 >> V2 >> S >> T;
    double distance = S + (V1 + V2) * T; // розрахунок відстані
    cout << "Вiдстань мiж автомобiлями через " << T << " год: " << distance << " км" << endl;
    cout << "-----------------------------" << endl;

    return 0;
}
